076923.python-image-preview@0.1.2
alefragnani.project-manager@12.8.0
anysphere.pyright@1.1.327
batisteo.vscode-django@1.15.0
bradlc.vscode-tailwindcss@0.14.25
britesnow.vscode-toggle-quotes@0.3.6
cstrap.flask-snippets@0.1.3
dbaeumer.vscode-eslint@3.0.10
donjayamanne.python-environment-manager@1.2.7
donjayamanne.python-extension-pack@1.7.0
dsznajder.es7-react-js-snippets@4.4.3
dzhavat.bracket-pair-toggler@0.0.3
eamodio.gitlens@17.3.2
ecmel.vscode-html-css@2.0.13
esbenp.prettier-vscode@11.0.0
formulahendry.auto-rename-tag@0.1.10
github.remotehub@0.64.0
humao.rest-client@0.26.0
kamikillerto.vscode-colorize@0.17.1
kevinrose.vsc-python-indent@1.21.0
kisstkondoros.vscode-gutter-preview@0.32.2
mariusalchimavicius.json-to-ts@1.8.0
mechatroner.rainbow-csv@3.19.0
mhutchie.git-graph@1.30.0
ms-azuretools.vscode-containers@2.1.0
ms-python.autopep8@2025.2.0
ms-python.debugpy@2025.8.0
ms-python.isort@2025.0.0
ms-python.python@2025.6.1
ms-python.vscode-pylance@2024.8.1
ms-toolsai.jupyter@2025.3.0
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.3.0
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
ms-vscode-remote.remote-containers@0.394.0
ms-vscode-remote.remote-ssh@0.113.1
ms-vscode-remote.remote-ssh-edit@0.87.0
ms-vscode.azure-repos@0.40.0
ms-vscode.js-debug-nightly@2025.6.317
ms-vscode.live-server@0.4.15
ms-vscode.remote-explorer@0.5.0
ms-vscode.remote-repositories@0.42.0
njpwerner.autodocstring@0.6.1
nucllear.vscode-extension-auto-import@1.4.3
pranaygp.vscode-css-peek@4.4.3
prisma.prisma@6.12.0
prisma.prisma-insider@31.0.7780
pulkitgangwar.nextjs-snippets@1.0.2
redhat.java@1.43.1
ritwickdey.liveserver@5.7.9
rooveterinaryinc.roo-cline@3.24.0
rvest.vs-code-prettier-eslint@5.1.0
shd101wyy.markdown-preview-enhanced@0.8.18
steoates.autoimport@1.5.4
streetsidesoftware.code-spell-checker@4.0.47
techer.open-in-browser@2.0.0
tomoki1207.pdf@1.2.2
tyriar.lorem-ipsum@1.3.1
vincaslt.highlight-matching-tag@0.11.0
visualstudioexptteam.intellicode-api-usage-examples@0.2.9
visualstudioexptteam.vscodeintellicode@1.3.2
vscjava.vscode-gradle@3.16.4
vscjava.vscode-java-debug@0.58.2
vscjava.vscode-java-dependency@0.24.1
vscjava.vscode-java-pack@0.29.2
vscjava.vscode-java-test@0.43.1
vscode-icons-team.vscode-icons@12.13.0
weidawang.quick-python-print@0.3.1
wix.vscode-import-cost@3.3.0
wolfieshorizon.python-auto-venv@1.3.2
wware.snippet-creator@1.1.3
xabikos.javascriptsnippets@1.8.0
yoavbls.pretty-ts-errors@0.6.1
yzhang.markdown-all-in-one@3.6.3
zignd.html-css-class-completion@1.20.0
